tap "argoproj/tap"
tap "aws/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jaehong21/tap"
tap "jandedobbeleer/oh-my-posh"
tap "jesseduffield/lazydocker"
tap "jesseduffield/lazygit"
tap "tursodatabase/tap"

brew "argoproj/tap/kubectl-argo-rollouts"
brew "aws/tap/eks-node-viewer"
brew "jaehong21/tap/hibiscus"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "jesseduffield/lazydocker/lazydocker"
brew "jesseduffield/lazygit/lazygit"
brew "tursodatabase/tap/turso"


# brew "gitui"
# brew "lima"
# brew "lsd"
# brew "qemu"

# docker
# brew "colima"
# brew "docker"
# brew "docker-compose"
# brew "docker-buildx"
# brew "docker-credential-helper"

brew "allure"
brew "ansible"
brew "antidote"
brew "argocd"
brew "autojump"
brew "awscli"
brew "dive"
brew "doggo"
brew "fd"
brew "fish"
brew "fisher"
brew "flyway"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "golang-migrate"
brew "gradle"
brew "grpcurl"
brew "helm"
brew "htop"
brew "hugo"
brew "istioctl"
brew "jq"
brew "k9s"
brew "krew"
brew "kube-ps1"
brew "kubernetes-cli"
brew "lsd"
brew "mas"
# brew "postgresql@14"
# brew "skopeo"
# brew "vault"
brew "minio-mc"
brew "mise"
brew "nvtop"
brew "opa"
brew "postgresql@17"
brew "pre-commit"
brew "protobuf"
brew "redis"
brew "ripgrep"
brew "rye"
brew "sd"
brew "step"
brew "tree"
brew "uv"
brew "watch"
brew "wget"
brew "xh"
brew "yamlfmt"
brew "yq"

cask "1password"
cask "1password-cli"
cask "another-redis-desktop-manager"
cask "arc"
cask "cloudflare-warp"
cask "font-hack-nerd-font"
cask "ghostty"
cask "hammerspoon"
cask "jetbrains-toolbox"
cask "jordanbaird-ice"
cask "linear-linear"
cask "notion"
cask "obsidian"
cask "orbstack"
cask "postman"
cask "pritunl"
cask "raycast"
cask "redis-insight"
cask "scroll-reverser"
cask "setapp"
cask "yaak"

mas "Channel Talk", id: 1102655071
mas "KakaoTalk", id: 869223134
mas "Microsoft Excel", id: 462058435
mas "Microsoft Outlook", id: 985367838
mas "Numbers", id: 409203825
mas "Okta Verify", id: 490179405
mas "Petrify", id: 1451177988
mas "RunCat", id: 1429033973
mas "Slack", id: 803453959
mas "Xcode", id: 497799835
